Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMS70_DFP/4.3.64/sams70a/xc32/ATSAMS70J20/startup_atsams70j20.c
/* Default empty handler */
void __attribute__((weak, used, optimize("-O1"), long_call, externally_visible)) Dummy_Handler(void);

/* Reset handler and application-provided reset handler */
void __attribute__((weak, optimize("-O1"), long_call, naked, externally_visible)) Reset_Handler(void);
extern void __attribute__((weak, used, long_call)) __XC32_RESET_HANDLER_NAME(void);

/* Cortex-M7 core handlers */
void NonMaskableInt_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void HardFault_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void MemoryManagement_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void BusFault_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void UsageFault_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SVCall_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DebugMonitor_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PendSV_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SysTick_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));

/* Peripherals handlers */
void SUPC_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void RSTC_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void RTC_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void RTT_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void WDT_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PMC_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EFC_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void UART0_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void UART1_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved9_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PIOA_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PIOB_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved12_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void USART0_Handler            ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void USART1_Handler            ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved15_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PIOD_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved17_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved18_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TWIHS0_Handler            ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TWIHS1_Handler            ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved21_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SSC_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TC0_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TC1_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TC2_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TC3_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TC4_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TC5_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void AFEC0_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DACC_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PWM0_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ICM_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ACC_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void USBHS_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved35_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved36_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved37_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved38_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved39_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void AFEC1_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved41_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved42_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void QSPI_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void UART2_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved45_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved46_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TC6_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TC7_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TC8_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TC9_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TC10_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TC11_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved53_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved54_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved55_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void AES_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TRNG_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void XDMAC_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ISI_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PWM1_Handler              ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void FPU_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved62_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void RSWDT_Handler             ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved64_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved65_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved66_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void Reserved67_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void IXC_Handler               ( void ) __attribute__ ((weak, alias("Dummy_Handler")));

/* Exception Table */
__attribute__ ((section(".vectors.default"), weak, externally_visible))
const DeviceVectors exception_table=
{
        /* Configure Initial Stack Pointer, using linker-generated symbols */
        .pvStack = (void*) (&_stack),

        .pfnReset_Handler              = (void*) __XC32_RESET_HANDLER_NAME,
        /* .pfnNonMaskableInt_Handler = */ (void*) NonMaskableInt_Handler,
        .pfnHardFault_Handler          = (void*) HardFault_Handler,
        /* .pfnMemoryManagement_Handler = */ (void*) MemoryManagement_Handler,
        .pfnBusFault_Handler           = (void*) BusFault_Handler,
        .pfnUsageFault_Handler         = (void*) UsageFault_Handler,
        /* .pvReservedC9            = */ (void*) (0UL), /* Reserved */
        /* .pvReservedC8            = */ (void*) (0UL), /* Reserved */
        /* .pvReservedC7            = */ (void*) (0UL), /* Reserved */
        /* .pvReservedC6            = */ (void*) (0UL), /* Reserved */
        /* .pfnSVCall_Handler       = */ (void*) SVCall_Handler,
        /* .pfnDebugMonitor_Handler = */ (void*) DebugMonitor_Handler,
        /* .pvReservedC3            = */ (void*) (0UL), /* Reserved */
        .pfnPendSV_Handler             = (void*) PendSV_Handler,
        .pfnSysTick_Handler            = (void*) SysTick_Handler,

#if (HEADER_FORMAT_VERSION_MAJOR > 1) /* include_mcc header file */
        /* Configurable interrupts with MCC names */
        /* .pfnSUPC_Handler         = */ (void*) SUPC_Handler,        /* 0  Supply Controller */
        /* .pfnRSTC_Handler         = */ (void*) RSTC_Handler,        /* 1  Reset Controller */
        /* .pfnRTC_Handler          = */ (void*) RTC_Handler,         /* 2  Real-time Clock */
        /* .pfnRTT_Handler          = */ (void*) RTT_Handler,         /* 3  Real-time Timer */
        /* .pfnWDT_Handler          = */ (void*) WDT_Handler,         /* 4  Watchdog Timer */
        /* .pfnPMC_Handler          = */ (void*) PMC_Handler,         /* 5  Power Management Controller */
        /* .pfnEFC_Handler          = */ (void*) EFC_Handler,         /* 6  Embedded Flash Controller */
        /* .pfnUART0_Handler        = */ (void*) UART0_Handler,       /* 7  Universal Asynchronous Receiver Transmitter */
        /* .pfnUART1_Handler        = */ (void*) UART1_Handler,       /* 8  Universal Asynchronous Receiver Transmitter */
        /* .pvReserved9             = */ (void*) (0UL),               /* 9  Reserved */
        /* .pfnPIOA_Handler         = */ (void*) PIOA_Handler,        /* 10 Parallel Input/Output Controller */
        /* .pfnPIOB_Handler         = */ (void*) PIOB_Handler,        /* 11 Parallel Input/Output Controller */
        /* .pvReserved12            = */ (void*) (0UL),               /* 12 Reserved */
        /* .pfnUSART0_Handler       = */ (void*) USART0_Handler,      /* 13 Universal Synchronous Asynchronous Receiver Transmitter */
        /* .pfnUSART1_Handler       = */ (void*) USART1_Handler,      /* 14 Universal Synchronous Asynchronous Receiver Transmitter */
        /* .pvReserved15            = */ (void*) (0UL),               /* 15 Reserved */
        /* .pfnPIOD_Handler         = */ (void*) PIOD_Handler,        /* 16 Parallel Input/Output Controller */
        /* .pvReserved17            = */ (void*) (0UL),               /* 17 Reserved */
        /* .pvReserved18            = */ (void*) (0UL),               /* 18 Reserved */
        /* .pfnTWIHS0_Handler       = */ (void*) TWIHS0_Handler,      /* 19 Two-wire Interface High Speed */
        /* .pfnTWIHS1_Handler       = */ (void*) TWIHS1_Handler,      /* 20 Two-wire Interface High Speed */
        /* .pvReserved21            = */ (void*) (0UL),               /* 21 Reserved */
        /* .pfnSSC_Handler          = */ (void*) SSC_Handler,         /* 22 Synchronous Serial Controller */
        /* .pfnTC0_Handler          = */ (void*) TC0_Handler,         /* 23 Timer Counter */
        /* .pfnTC1_Handler          = */ (void*) TC1_Handler,         /* 24 Timer Counter */
        /* .pfnTC2_Handler          = */ (void*) TC2_Handler,         /* 25 Timer Counter */
        /* .pfnTC3_Handler          = */ (void*) TC3_Handler,         /* 26 Timer Counter */
        /* .pfnTC4_Handler          = */ (void*) TC4_Handler,         /* 27 Timer Counter */
        /* .pfnTC5_Handler          = */ (void*) TC5_Handler,         /* 28 Timer Counter */
        /* .pfnAFEC0_Handler        = */ (void*) AFEC0_Handler,       /* 29 Analog Front-End Controller */
        /* .pfnDACC_Handler         = */ (void*) DACC_Handler,        /* 30 Digital-to-Analog Converter Controller */
        /* .pfnPWM0_Handler         = */ (void*) PWM0_Handler,        /* 31 Pulse Width Modulation Controller */
        /* .pfnICM_Handler          = */ (void*) ICM_Handler,         /* 32 Integrity Check Monitor */
        /* .pfnACC_Handler          = */ (void*) ACC_Handler,         /* 33 Analog Comparator Controller */
        /* .pfnUSBHS_Handler        = */ (void*) USBHS_Handler,       /* 34 USB High-Speed Interface */
        /* .pvReserved35            = */ (void*) (0UL),               /* 35 Reserved */
        /* .pvReserved36            = */ (void*) (0UL),               /* 36 Reserved */
        /* .pvReserved37            = */ (void*) (0UL),               /* 37 Reserved */
        /* .pvReserved38            = */ (void*) (0UL),               /* 38 Reserved */
        /* .pvReserved39            = */ (void*) (0UL),               /* 39 Reserved */
        /* .pfnAFEC1_Handler        = */ (void*) AFEC1_Handler,       /* 40 Analog Front-End Controller */
        /* .pvReserved41            = */ (void*) (0UL),               /* 41 Reserved */
        /* .pvReserved42            = */ (void*) (0UL),               /* 42 Reserved */
        /* .pfnQSPI_Handler         = */ (void*) QSPI_Handler,        /* 43 Quad Serial Peripheral Interface */
        /* .pfnUART2_Handler        = */ (void*) UART2_Handler,       /* 44 Universal Asynchronous Receiver Transmitter */
        /* .pvReserved45            = */ (void*) (0UL),               /* 45 Reserved */
        /* .pvReserved46            = */ (void*) (0UL),               /* 46 Reserved */
        /* .pfnTC6_Handler          = */ (void*) TC6_Handler,         /* 47 Timer Counter */
        /* .pfnTC7_Handler          = */ (void*) TC7_Handler,         /* 48 Timer Counter */
        /* .pfnTC8_Handler          = */ (void*) TC8_Handler,         /* 49 Timer Counter */
        /* .pfnTC9_Handler          = */ (void*) TC9_Handler,         /* 50 Timer Counter */
        /* .pfnTC10_Handler         = */ (void*) TC10_Handler,        /* 51 Timer Counter */
        /* .pfnTC11_Handler         = */ (void*) TC11_Handler,        /* 52 Timer Counter */
        /* .pvReserved53            = */ (void*) (0UL),               /* 53 Reserved */
        /* .pvReserved54            = */ (void*) (0UL),               /* 54 Reserved */
        /* .pvReserved55            = */ (void*) (0UL),               /* 55 Reserved */
        /* .pfnAES_Handler          = */ (void*) AES_Handler,         /* 56 Advanced Encryption Standard */
        /* .pfnTRNG_Handler         = */ (void*) TRNG_Handler,        /* 57 True Random Number Generator */
        /* .pfnXDMAC_Handler        = */ (void*) XDMAC_Handler,       /* 58 Extensible DMA Controller */
        /* .pfnISI_Handler          = */ (void*) ISI_Handler,         /* 59 Image Sensor Interface */
        /* .pfnPWM1_Handler         = */ (void*) PWM1_Handler,        /* 60 Pulse Width Modulation Controller */
        /* .pfnFPU_Handler          = */ (void*) FPU_Handler,         /* 61 Floating Point Unit */
        /* .pvReserved62            = */ (void*) (0UL),               /* 62 Reserved */
        /* .pfnRSWDT_Handler        = */ (void*) RSWDT_Handler,       /* 63 Reinforced Safety Watchdog Timer */
        /* .pvReserved64            = */ (void*) (0UL),               /* 64 Reserved */
        /* .pvReserved65            = */ (void*) (0UL),               /* 65 Reserved */
        /* .pvReserved66            = */ (void*) (0UL),               /* 66 Reserved */
        /* .pvReserved67            = */ (void*) (0UL),               /* 67 Reserved */
        /* .pfnIXC_Handler          = */ (void*) IXC_Handler          /* 68 Floating Point Unit */

#else /* Legacy defined(_SAMS70J20_H) */
        /* Configurable interrupts with Legacy names */
        /* .pfnSUPC_Handler         = */ (void*) SUPC_Handler,        /* 0  Supply Controller */
        /* .pfnRSTC_Handler         = */ (void*) RSTC_Handler,        /* 1  Reset Controller */
        /* .pfnRTC_Handler          = */ (void*) RTC_Handler,         /* 2  Real-time Clock */
        /* .pfnRTT_Handler          = */ (void*) RTT_Handler,         /* 3  Real-time Timer */
        /* .pfnWDT_Handler          = */ (void*) WDT_Handler,         /* 4  Watchdog Timer */
        /* .pfnPMC_Handler          = */ (void*) PMC_Handler,         /* 5  Power Management Controller */
        /* .pfnEFC_Handler          = */ (void*) EFC_Handler,         /* 6  Embedded Flash Controller */
        /* .pfnUART0_Handler        = */ (void*) UART0_Handler,       /* 7  Universal Asynchronous Receiver Transmitter */
        /* .pfnUART1_Handler        = */ (void*) UART1_Handler,       /* 8  Universal Asynchronous Receiver Transmitter */
        /* .pvReserved9             = */ (void*) (0UL),               /* 9  Reserved */
        /* .pfnPIOA_Handler         = */ (void*) PIOA_Handler,        /* 10 Parallel Input/Output Controller */
        /* .pfnPIOB_Handler         = */ (void*) PIOB_Handler,        /* 11 Parallel Input/Output Controller */
        /* .pvReserved12            = */ (void*) (0UL),               /* 12 Reserved */
        /* .pfnUSART0_Handler       = */ (void*) USART0_Handler,      /* 13 Universal Synchronous Asynchronous Receiver Transmitter */
        /* .pfnUSART1_Handler       = */ (void*) USART1_Handler,      /* 14 Universal Synchronous Asynchronous Receiver Transmitter */
        /* .pvReserved15            = */ (void*) (0UL),               /* 15 Reserved */
        /* .pfnPIOD_Handler         = */ (void*) PIOD_Handler,        /* 16 Parallel Input/Output Controller */
        /* .pvReserved17            = */ (void*) (0UL),               /* 17 Reserved */
        /* .pvReserved18            = */ (void*) (0UL),               /* 18 Reserved */
        /* .pfnTWIHS0_Handler       = */ (void*) TWIHS0_Handler,      /* 19 Two-wire Interface High Speed */
        /* .pfnTWIHS1_Handler       = */ (void*) TWIHS1_Handler,      /* 20 Two-wire Interface High Speed */
        /* .pvReserved21            = */ (void*) (0UL),               /* 21 Reserved */
        /* .pfnSSC_Handler          = */ (void*) SSC_Handler,         /* 22 Synchronous Serial Controller */
        /* .pfnTC0_Handler          = */ (void*) TC0_Handler,         /* 23 Timer Counter */
        /* .pfnTC1_Handler          = */ (void*) TC1_Handler,         /* 24 Timer Counter */
        /* .pfnTC2_Handler          = */ (void*) TC2_Handler,         /* 25 Timer Counter */
        /* .pfnTC3_Handler          = */ (void*) TC3_Handler,         /* 26 Timer Counter */
        /* .pfnTC4_Handler          = */ (void*) TC4_Handler,         /* 27 Timer Counter */
        /* .pfnTC5_Handler          = */ (void*) TC5_Handler,         /* 28 Timer Counter */
        /* .pfnAFEC0_Handler        = */ (void*) AFEC0_Handler,       /* 29 Analog Front-End Controller */
        /* .pfnDACC_Handler         = */ (void*) DACC_Handler,        /* 30 Digital-to-Analog Converter Controller */
        /* .pfnPWM0_Handler         = */ (void*) PWM0_Handler,        /* 31 Pulse Width Modulation Controller */
        /* .pfnICM_Handler          = */ (void*) ICM_Handler,         /* 32 Integrity Check Monitor */
        /* .pfnACC_Handler          = */ (void*) ACC_Handler,         /* 33 Analog Comparator Controller */
        /* .pfnUSBHS_Handler        = */ (void*) USBHS_Handler,       /* 34 USB High-Speed Interface */
        /* .pvReserved35            = */ (void*) (0UL),               /* 35 Reserved */
        /* .pvReserved36            = */ (void*) (0UL),               /* 36 Reserved */
        /* .pvReserved37            = */ (void*) (0UL),               /* 37 Reserved */
        /* .pvReserved38            = */ (void*) (0UL),               /* 38 Reserved */
        /* .pvReserved39            = */ (void*) (0UL),               /* 39 Reserved */
        /* .pfnAFEC1_Handler        = */ (void*) AFEC1_Handler,       /* 40 Analog Front-End Controller */
        /* .pvReserved41            = */ (void*) (0UL),               /* 41 Reserved */
        /* .pvReserved42            = */ (void*) (0UL),               /* 42 Reserved */
        /* .pfnQSPI_Handler         = */ (void*) QSPI_Handler,        /* 43 Quad Serial Peripheral Interface */
        /* .pfnUART2_Handler        = */ (void*) UART2_Handler,       /* 44 Universal Asynchronous Receiver Transmitter */
        /* .pvReserved45            = */ (void*) (0UL),               /* 45 Reserved */
        /* .pvReserved46            = */ (void*) (0UL),               /* 46 Reserved */
        /* .pfnTC6_Handler          = */ (void*) TC6_Handler,         /* 47 Timer Counter */
        /* .pfnTC7_Handler          = */ (void*) TC7_Handler,         /* 48 Timer Counter */
        /* .pfnTC8_Handler          = */ (void*) TC8_Handler,         /* 49 Timer Counter */
        /* .pfnTC9_Handler          = */ (void*) TC9_Handler,         /* 50 Timer Counter */
        /* .pfnTC10_Handler         = */ (void*) TC10_Handler,        /* 51 Timer Counter */
        /* .pfnTC11_Handler         = */ (void*) TC11_Handler,        /* 52 Timer Counter */
        /* .pvReserved53            = */ (void*) (0UL),               /* 53 Reserved */
        /* .pvReserved54            = */ (void*) (0UL),               /* 54 Reserved */
        /* .pvReserved55            = */ (void*) (0UL),               /* 55 Reserved */
        /* .pfnAES_Handler          = */ (void*) AES_Handler,         /* 56 Advanced Encryption Standard */
        /* .pfnTRNG_Handler         = */ (void*) TRNG_Handler,        /* 57 True Random Number Generator */
        /* .pfnXDMAC_Handler        = */ (void*) XDMAC_Handler,       /* 58 Extensible DMA Controller */
        /* .pfnISI_Handler          = */ (void*) ISI_Handler,         /* 59 Image Sensor Interface */
        /* .pfnPWM1_Handler         = */ (void*) PWM1_Handler,        /* 60 Pulse Width Modulation Controller */
        /* .pfnFPU_Handler          = */ (void*) FPU_Handler,         /* 61 Floating Point Unit */
        /* .pvReserved62            = */ (void*) (0UL),               /* 62 Reserved */
        /* .pfnRSWDT_Handler        = */ (void*) RSWDT_Handler,       /* 63 Reinforced Safety Watchdog Timer */
        /* .pvReserved64            = */ (void*) (0UL),               /* 64 Reserved */
        /* .pvReserved65            = */ (void*) (0UL),               /* 65 Reserved */
        /* .pvReserved66            = */ (void*) (0UL),               /* 66 Reserved */
        /* .pvReserved67            = */ (void*) (0UL),               /* 67 Reserved */
        /* .pfnIXC_Handler          = */ (void*) IXC_Handler          /* 68 Floating Point Unit */
#endif
};

#if (__ARM_FP==14) || (__ARM_FP==4)
/* These functions are used only when compiling with -mfloat-abi=softfp or -mfloat-abi=hard */
/* Save and restore IRQs */
typedef uint32_t irqflags_t;
static bool g_interrupt_enabled;
#define cpu_irq_is_enabled()    (__get_PRIMASK() == 0)
#  define cpu_irq_enable()                             \
        do {                                           \
                g_interrupt_enabled = true;            \
                __DMB();                               \
                __enable_irq();                        \
        } while (0)
#  define cpu_irq_disable()                            \
        do {                                           \
                __disable_irq();                       \
                __DMB();                               \
                g_interrupt_enabled = false;           \
        } while (0)
__always_inline __STATIC_INLINE bool __attribute__((optimize("-O1"))) cpu_irq_is_enabled_flags(irqflags_t flags)
{
        return (flags);
}
__always_inline __STATIC_INLINE void __attribute__((optimize("-O1"))) cpu_irq_restore(irqflags_t flags)
{
        if (cpu_irq_is_enabled_flags(flags))
                cpu_irq_enable();
}
__always_inline __STATIC_INLINE __attribute__((optimize("-O1"))) irqflags_t cpu_irq_save(void)
{
        volatile irqflags_t flags = cpu_irq_is_enabled();
        cpu_irq_disable();
        return flags;
}

